Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: If you think your library should be built into the basic Logisim release, then I welcome your suggestion, and I'll be happy to acknowledge your contribution in Logisim releases including the work.
ru_ru: Если вы считаете, что ваша библиотека должна быть встроена в основной выпуск Logisim, то я приветствую ваше предложение, и я буду рад признать ваш вклад в выпуски Logisim, включающие вашу работу.

source: Back to Library Reference
ru_ru: Назад к Справке по библиотеке

source: Move Down moves the currently selected component in the selection back one spot.
ru_ru: Сдвинуть вниз перемещает компонент, выделенный в данный момент в выборке, вниз на одну позицию.

source: After this circuit has been built, we then execute Logisim from the command line, providing the filename of the project and the -tty option with the table parameter.
ru_ru: После постройки этой схемы мы запустим Logisim из командной строки, передавая имя файла проекта и параметр -tty с аргументом table.

source: Enable: When this is 0, clock triggers are ignored.
ru_ru: Включение: когда на этом входе 0, срабатывания тактового входа игнорируются.

source: For a ground element, indicated by an arrow of three shortening parallel lines, this value will be zero (or, if the Data Bits attribute is more than 1, an all-zero value).
ru_ru: Для элемента Земля, обозначаемого стрелкой, состоящей из трёх укорачивающихся параллельных линий, это значение будет нулём (или если значение атрибута Биты данных больше единицы, то значение, состоящее из всех нулей).

source: The dialog includes a table with five columns:
ru_ru: Диалог включает таблицу с пятью столбцами:

source: Suffice it to say that the algorithm is sophisticated enough to account for gate delays, but not realistic enough to account for more difficult phenomena like varying voltages or race conditions.
ru_ru: Достаточно сказать, что алгоритм является достаточно сложным, чтобы учитывать задержки элементов, но не достаточно реалистичным, чтобы учитывать сложные явления, такие как колебание напряжения или состояние гонки.

source: The bit width of an added wire is inferred from the components to which it is connected.
ru_ru: Разрядность добавленного провода определяется компонентами, к которым он подключен.

source: Gray Code Incrementer
ru_ru: Инкрементатор кода Грея

source: Removes all components in the current selection from the circuit, without modifying the clipboard.
ru_ru: Удаляет из схемы все компоненты в текущем выделении без изменений в буфере обмена.

source: Next: Creating bundles.
ru_ru: Далее: Создание пучков.

source: Editing subcircuit appearance
ru_ru: Изменение внешнего вида подсхемы

source: South edge, left pin (input, bit width 1)
ru_ru: Южный край, левый контакт (вход, разрядность равна 1)

source: The bit width of the combined end.
ru_ru: Разрядность объединённого конца.

source: Logisim is already simulating the circuit.
ru_ru: Logisim уже моделирует схему.

source: The user can drag the red knob within the rounded-square area, and the outputs update to indicate the knob's current x- and y-coordinates.
ru_ru: Пользователь может перетаскивать красную рукоятку в пределах области, ограниченной скруглённым квадратом, и значения на выходах изменятся в соответствии с текущими х и у координатами рукоятки.

source: If an existing label doesn't follow the Java-identifier rule, then Logisim will attempt to extract a valid name from the label if at all possible.
ru_ru: Если существующая метка не соответствует правилам для Java идентификаторов, то Logisim попытается выделить допустимое имя из метки, если это вообще возможно.

source: You can click the Karnaugh map to change the corresponding truth table values.
ru_ru: Вы можете щёлкать на карте Карно для изменения соответствующих значений таблицы истинности.

source: The pins on this box correspond to the input and output pins in the 2:1 MUX circuit.
ru_ru: Контакты на этой коробке соответствую входным и выходным контактам в схеме 2:1 MUX.

source: Determines whether to draw a wider or narrower version of the component.
ru_ru: Определяет, следует отрисовывать широкую или узкую версию компонента.

source: For an input pin, the attribute specifies how floating values should be treated when received as an input, perhaps from a circuit using the layout as a subcircuit.
ru_ru: Для входного контакта атрибут определяет, каким образом следует рассматривать плавающие значения, когда они приняты на входе, возможно с использованием чертежа как подсхемы.

source: Scale Factor: You can scale the images as they are dumped into image files using this slider.
ru_ru: Масштабный коэффициент: с помощью этого ползунка вы можете изменять масштаб изображений, в котором они сохраняются в файлы.

source: Double-clicking an element in this hierarchy will display what is happening inside that subcircuit.
ru_ru: Двойной щелчок на элементе в этой иерархии покажет, что происходит внутри этой подсхемы.

source: Next: The Simulate menu.
ru_ru: Далее: Меню Моделировать.

source: Change Radix cycles the radix for the currently selected component in the selection between 2 (binary), 10 (decimal), and 16 (hexadecimal).
ru_ru: Изменить основание переключает основание для компонента, выделенного в данный момент в выборке между 2 (двоичным), 10 (десятичным), и 16 (шестнадцатеричным).

source: We wire it so that there is just one output, which is 1 as long as the two subcircuits agree.
ru_ru: Мы соединяем их так, что получается только один выход, на котором 1, пока две подсхемы дают на выходе согласованные значения.

source: Input Format (read-only after component is created)
ru_ru: Формат входа (только для чтения после создания компонента)

source: Conceivably, a large circuit that does not oscillate could lead to trouble.
ru_ru: Предположительно, большие схемы, которые не возбуждаются, могут привести к проблеме.

source: As you can see, the master circuit uses Logisim's built-in adder, while the query circuit uses two subcircuits representing a half adder and a full adder (which themselves are built up of simple gates).
ru_ru: Как вы видите, эталонная схема использует встроенный в Logisim сумматор, а проверяемая схема использует две подсхемы, представляющие собой полусумматор и полный сумматор (которые в свою очередь построены из простых логических элементов).

source: When you paste components, they will not immediately be dropped; instead, they will be drawn in light gray.
ru_ru: Когда вы вставляете компоненты, они не будут сброшены мгновенно; вместо этого они будут отрисованы светло-серым.

source: Wiring Tool
ru_ru: Инструмент Проводка

source: After building up the circuit, we end up with the following.
ru_ru: После создания схемы мы получим следующее.

source: 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
ru_ru: 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA Copyright (C) перевод на русский язык, 1993 Кузина О.В., Юфа В.М. 1998 Тихонов О.С.

source: Library Class
ru_ru: Класс Library

source: Displays the values of its eight one-bit inputs.
ru_ru: Отображает значения восьми своих однобитных входов.

source: Below is the Remove button, where you can delete the mapping that is currently selected in the table above the button.
ru_ru: Ниже - кнопка Удалить, с помощью которой вы можете удалить выбранную в таблице выше привязку.

source: When we speak of free software, we are referring to freedom, not price.
ru_ru: Когда мы говорим о свободном ПО, мы имеем в виду свободу, а не цену.

source: Shortcomings
ru_ru: Недостатки

source: When the component is selected or being added, the digits '0' through '9' alter its Output Bits attribute, Alt-0 through Alt-9 alter its Data Bits attribute, and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Выходные биты, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, а клавиши со стрелками меняют его атрибут Направление.

source: Changes the explorer pane to displaying the hierarchy of subcircuits in the current simulation.
ru_ru: Изменяет панель проводника для отображения иерархии подсхем в текущем моделировании.

source: Here, we'll use redirection (the > operator) to save the output of each circuit into a file.
ru_ru: Здесь мы будем использовать перенаправление (оператор >), чтобы сохранять вывод каждой схемы в файл.

source: If multiple bits correspond to the same split end, then their relative ordering will be the same as in the combined end.
ru_ru: Если несколько битов соответствуют одному и тому же разъединённому концу, то их относительный порядок будет тем же, что и в объединённом конце.

source: Right now, each time we select the AND tool, it creates a large AND gate.
ru_ru: Сейчас, каждый раз, когда мы выбираем инструмент Элемент И, он создаёт большой элемент И.

source: The middle column of buttons allows the manipulation of the items within the selection.
ru_ru: Средний столбец кнопок позволяет манипулировать элементами внутри выборки.

source: As long as this input is 1, the other inputs have no effect, except for the asynchronous reset input, which has priority.
ru_ru: Пока на этом входе 1, другие входы не имеют эффекта, за исключением входа Асинхронный сброс - он имеет приоритет.

source: For GrayIncrementer, each instance has a "bit width"
ru_ru: Для GrayIncrementer каждый экземпляр имеет "разрядность",

source: Low Duration
ru_ru: Продолжительность нуля

source: The values at n-gate and p-gate are expected to be opposite to each other.
ru_ru: Ожидается, что значения на n-затворе и p-затворе противоположны друг другу.

source: Closes all windows associated with the currently viewed project.
ru_ru: Закрывает все окна, связанные с просматриваемым в данный момент проектом.

source: View Toolbox
ru_ru: Показать инструменты

source: For an executable work, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the executable.
ru_ru: Для исполняемого произведения полный исходный код означает все исходные коды для всех модулей, которые он содержит, плюс любые связанные с произведением файлы определения интерфейса, плюс сценарии, используемые для управления компиляцией и установкой исполняемого произведения.

source: Logisim has two types of circuit components: those that are designed within Logisim as combinations of components, and those primitive components that are written in Java.
ru_ru: В Logisim есть два типа компонентов схемы: те, которые разработаны в Logisim как сочетания компонентов, и примитивные компоненты, написанные на Java.

source: Poking memory
ru_ru: Нажатие на память

source: 1 if the first input is greater than the second input, 0 if the first input is less than or equal the second input.
ru_ru: На этом выходе 1, если значение на первом входе больше, чем на втором, и 0, если меньше или равно.

source: 1 if the desired bit is found, 0 if all input bits are the inverse of the desired bit, and the error value if a non-0, non-1 value is found before the desired bit.
ru_ru: Значение равно 1, если желаемый бит найден, 0, если все входные биты противоположны желаемому биту, и значение ошибки, если значение не равное 0 или 1 найдено до желаемого бита.

source: Keep connections while moving: Indicates whether Logisim should add new wires when components are moved to preserve their connections.
ru_ru: Сохранять соединения при перемещении: указывает, должен ли Logisim добавлять новые провода, когда компоненты перемещены, чтобы сохранять их соединения.

source: If an involved point lies within a subcircuit, Logisim will draw that subcircuit's outline in red.
ru_ru: Если участвующая точка лежит внутри подсхемы, то Logisim отрисует контур подсхемы красным.

source: It is by Uwe Zimmermann, a faculty member at Uppsala University in Sweden.
ru_ru: Его выполнил Уве Зиммерманн, преподаватель университета Уппсалы в Швеции.

source: When the component is selected or being added, the digits '1' through '4' alter its Select Bits attribute and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 1 до 4 меняют его атрибут Выбирающие биты, а клавиши со стрелками меняют его атрибут Направление.

source: This drop-down box attempts to configure Logisim to set this up; reports about whether this drop-down box has any effect on performance would be welcome.
ru_ru: Этот выпадающий список пытается настроить Logisim так, чтобы эта возможность была включена; сообщения о том, влияет ли этот список на производительность, будут приветствоваться.

source: And, although XOR and XNOR gates really ought to be the same width as OR and NOR gates with the rectangular style, they are not because of difficulties compressing the shaped-XOR gate.
ru_ru: Ещё, хотя элементы Исключающее ИЛИ и Исключающее ИЛИ-НЕ должны быть той же ширины, что и элементы ИЛИ и ИЛИ-НЕ в прямоугольном стиле, они имеют разную ширину из-за сложностей при сжатии фигурного элемента Исключающее ИЛИ.

source: We are now in a position to summarize the full rainbow of colors that Logisim wires can take on.
ru_ru: Сейчас нам уместно обобщить все цвета радуги, которые могут иметь провода в Logisim.

source: You can edit those attribute values here.
ru_ru: Здесь вы можете редактировать значения этих атрибутов.

source: The current version is supplied with English, Spanish, Russian, and German translations.
ru_ru: Текущая версия снабжена переводами на английский, испанский, русский и немецкий языки.

source: (Disabling ticks or changing the maximum tick rate will clear its history.)
ru_ru: (Выключение тактов или изменение максимальной тактовой частоты очистит эту историю.)

source: Arithmetic: Components that perform arithmetic.
ru_ru: Арифметика: компоненты, выполняющие арифметические действия.

source: source
ru_ru: исток

source: The wiring tool is the tool for creating wire segments that carry values from one endpoint to another.
ru_ru: Инструмент Проводка - это инструмент для для создания сегментов проводов, которые передают значения из одного конца в другой.

source: The location of the gate input.
ru_ru: Положение входа затвор.

source: customarily used for software interchange; or,
ru_ru: приведенными выше; или

source: This circuit is currently in a stable condition.
ru_ru: В данный момент эта схема в стабильном состоянии.

source: Any duplicate rows are not added into the log.
ru_ru: Повторяющиеся строки не добавляются в журнал.

source: If the select input contains any unspecified bits, then all outputs are floating.
ru_ru: Если выбирающий вход содержит неопределённые биты, то значения на всех выходах будут плавающими.

source: Bright green: The wire is carrying a one-bit 1 value.
ru_ru: Яркий зелёный: Провод несёт однобитное значение 1.

source: Shift-drag keeps the line's angle at a multiple of 45°.
ru_ru: Перетаскивание мыши с зажатой Shift держит линию под углом, кратным 45°.

source: Practitioners use three major techniques for summarizing the behavior of such circuits.
ru_ru: Практики используют три основных метода для обобщения поведения таких схем.

source: We call this a floating bit; some people call it a high-impedance value.
ru_ru: Мы называем это плавающим битом; некоторые называют это высокоимпедансным состоянием.

source: Internally, the subtractor simply performs a bitwise NOT on the subtrahend, and add this to the minuend along with the NOT of the borrow-in input.
ru_ru: Внутренне вычитатель просто выполняет побитовое НЕ над вычитаемым и прибавляет результат к уменьшаемому вместе с дополнением значения с входа займа.

source: If you select a pre-existing file, Logisim will ask whether you want to overwrite the file or append the new entries onto the end.
ru_ru: Если вы выберите уже существующий файл, то Logisim спросит, хотите вы перезаписать файл, или добавить новые записи в конец.

source: Output: the highest index among those inputs whose value is 1 - or all floating bits if no inputs are 1 or if the component is disabled via the Enable In input.
ru_ru: Выход: наибольший номер среди тех входов, чьи значения равны 1; или все плавающие биты, если ни один вход не содержит 1 или если компонент отключен с помощью разрешающего входа.

source: The counter's value remains at the maximum (or 0 if decrementing)
ru_ru: Значение счётчика остаётся на максимуме (или на 0 при уменьшении)

source: (This feature can be useful for instructors who assign students to build projects using a subset of Logisim's libraries.)
ru_ru: (Эта возможность может быть полезна для преподавателей, дающих студентам задания строить проекты, используя подмножество библиотек Logisim.)

source: The number of input values.
ru_ru: Количество входных значений.

source: // after its input.
ru_ru: // после поступления значения на вход.

source: You can place comments into the file by using the '#' symbol: All characters in the line starting from the '#' symbol will be ignored by Logisim.
ru_ru: Вы можете размещать комментарии в файле, используя символ '#': все символы в строке, начиная с '#' будут игнорироваться Logisim.

source: These components are included even if they are nested deeply in the subcircuit hierarchy.
ru_ru: Эти компоненты учитываются, даже если они вложены глубоко в иерархию подсхем.

source: The divider essentially performs unsigned division.
ru_ru: Делитель по существу выполняет беззнаковое деление.

source: If this is 0 (the default), then the starting value is based on the time that the random sequence began.
ru_ru: Когда равно 0 (по умолчанию), стартовое значение основано на времени запуска псевдослучайной последовательности.

source: There, we load adder-master.circ as a Logisim Library (Project > Load Library > Logisim Library…), and we insert its 2-bit adder as a subcircuit.
ru_ru: Затем мы загружаем adder-master.circ как библиотеку Logisim (Проект > Загрузить библиотеку > Библиотека Logisim…), и добавляем двухбитный сумматор оттуда как подсхему.

source: The only significance of this is that the main circuit is the one that is displayed when you first open the project.
ru_ru: Единственное значение этого - это то, что главная схема отображается, когда вы первый раз открываете проект.

source: The Iterations Until Oscillation drop-down menu specifies how long to simulate a circuit before deciding that it is oscillating.
ru_ru: Раскрывающееся меню Итераций до возбуждения определяет, как долго моделировать схему, прежде чем принять решение, что она возбуждается.

source: Each port indicates how a wire connecting into the circuit will correspond to an input or output pin within the layout.
ru_ru: Каждый порт указывает, как провод, соединяющийся со схемой, будет соответствовать входному или выходному контакту на чертеже.

source: Copies an input on the west edge onto the output on the east edge; which of the inputs to copy is specified via the current value received through the input on the south edge.
ru_ru: Копирует значение со входа на западном крае на выход на восточном крае; какое из входных значений должно быть копировано, определяется текущим значением, принятым на входе на южном крае.

source: A Logisim library holds a set of tools that allow you to interact with a circuit via clicking and dragging the mouse in the canvas area.
ru_ru: Библиотека Logisim содержит набор инструментов для взаимодействия со схемой с помощью щелчков и перетаскиваний мышью в области холста.

source: interactive use in the most ordinary way, to print or display an
ru_ru: интерактивном режиме обычным для нее способом она печатала или выводила на экран

source: Unique: The number of times that component appears in the circuit's hierarchy, where each subcircuit within the hierarchy is counted only once.
ru_ru: Уникальных: сколько раз компонент встречается в иерархии схемы, при условии, что каждая подсхема в иерархии считается только один раз.

source: If you look through the choices in the Gates library, you'll notice that there was no need for us to develop a XOR circuit earlier: It's built into Logisim.
ru_ru: Если вы просмотрите варианты в библиотеке Элементы, вы заметите, что у нас не было необходимости разрабатывать схему Исключающее ИЛИ ранее: она встроена в Logisim.

source: I am unaware of any standard term for such a concept; the only term I have heard used is bus ripper, but this term is unnecessarily violent for my tastes.
ru_ru: Мне неизвестен какой-либо стандартный термин для такого понятия; единственное словосочетание, которое я слышал, это делитель шины, но этот термин является излишне резким на мой взгляд.

source: The color with which to draw the terminal's background.
ru_ru: Цвет, которым отрисовывается фон терминала.

source: Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.
ru_ru: Наше решение будет руководствоваться двумя целями: сохранения свободного статуса всех производных нашего свободного ПО и содействия совместному и повторному использованию ПО вообще.

source: Here, we've attached a two-bit component to a one-bit component, so they are incompatible.
ru_ru: Здесь мы присоединили двухбитный компонент к однобитному, поэтому они несовместимы.

source: Configures which type of gate to use.
ru_ru: Задаёт какой использовать тип логических элементов.

source: This input is ignored if the Load input is 1.
ru_ru: Этот вход игнорируется, если на входе Загрузка 1.

source: The Base library includes general-purpose tools.
ru_ru: Библиотека Базовые содержит инструменты общего назначения.

source: For components which have labels associated with them, their names correspond to the labels; other components' names specify their type and their location within the circuit.
ru_ru: Для компонентов, имеющих метки, связанные с ними, имена соответствуют меткам; имена других компонентов определяют их тип и расположение в схеме.

source: The input's bit width.
ru_ru: Разрядность входного значения.

source: Off Color
ru_ru: Цвет выключенных

source: Available only when editing a circuit's appearance, this menu item raises the currently selected object(s) to be drawn on top of all other objects.
ru_ru: Доступный только при редактировании внешнего вида схемы, этот пункт меню поднимает выделенный в данный момент объект(ы) так, чтобы он оказался над всеми другими объектами.

source: This could be 0, 1, or the error value.
ru_ru: Оно может быть 0, 1, или значением ошибки.

source: Color
ru_ru: Цвет

source: Red: The wire is carrying an error value.
ru_ru: Красный: Провод несёт значение ошибки.

source: (In Logisim, the value in the flip-flop remains unchanged.)
ru_ru: (В Logisim значение триггера остается неизменным.)

source: With the capacity to build larger circuits from smaller subcircuits, and to draw bundles of wires with a single mouse drag, Logisim can be used (and is used) to design and simulate entire CPUs for educational purposes.
ru_ru: При возможности постройки больших схем из меньших подсхем и рисования пучков проводов одним перетаскиванием мыши, Logisim может быть использован (и используется) для проектирования и моделирования целых процессоров в образовательных целях.

source: Logisim will draw short stubs illustrating this; and if you overshoot a stub, it will silently assume that you did not mean to overshoot it.
ru_ru: Logisim отрисовывает короткие отрезки чтобы показать это; если вы перекроете отрезок, программа будет без предупреждений предполагать, что вы не хотели перекрыть его.

source: As an added bonus, we'll get a circuit that's looks nicer than what you probably would draw by hand.
ru_ru: В качестве дополнительного бонуса мы получим схему, которая выглядит лучше, чем то, что вы, вероятно, могли бы нарисовать от руки.
